---
kind: method
id: M:Autodesk.Revit.DB.Events.DocumentPrintedEventArgs.GetPrintedViewElementIds
source: html/679b375e-216c-5cee-d431-dc593649bac4.htm
---
# Autodesk.Revit.DB.Events.DocumentPrintedEventArgs.GetPrintedViewElementIds Method

Returns ElementIds of the views that printed successfully.

## Syntax (C#)
```csharp
public IList<ElementId> GetPrintedViewElementIds()
```

## Returns
ElementIds of the views that printed successfully.